#include <iostream>
#include <cmath>

using namespace std;


// Вариант 8
// Написать программу, которая считывает текст из файла и записывает в другой файл только
// цитаты (предложения, заключѐнные в кавычки).

// 1. С использованием библиотек потокового ввода-вывода (<fstream>).
// 2. С использованием библиотек стандартного ввода-вывода (<cstdio>)

int main()
{
    cout<<"hello world";
}
